app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY lower(title) ASC
---
  def index
    @all_ratings = Movie.ratings
    if params[:sort_by].nil? && params[:ratings].nil?  && params[:commit].nil?
      if params[:commit].nil?
        if session[:ratings].nil?
          session[:ratings] = {}
          @all_ratings.each{|x| session[:ratings][x] = 1}